import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import matplotlib.font_manager as fm

# 한글 처리
from matplotlib import font_manager, rc
font_path = "c:/windows/Fonts/malgun.ttf" #한글 폰트 경로
font_name = font_manager.FontProperties(fname=font_path).get_name()
rc('font', family = font_name)

# load data
df = pd.read_csv(r'C:\Users\luisf\OneDrive\바탕 화면\WorkSpace\Sogang_AI_MBA_Project\Sogang_AI_MBA_PythonProj\BigDataMarketing\2차과제\분석\1차 취합 및 분석\마포구 브랜드별 비교\브랜드비교_마포구 - BBQ.CSV', encoding='utf-8-sig')
# data column 확인
print(df.columns)

# order list 종류 및 개수 확인
# for items in df['order_items'].unique():
#     print(items)

# 'region' 열을 기준으로 그룹화하고, 특정 열들의 NaN을 제외한 값을 하나의 리스트로 묶기
grouped_df = df.groupby('region').apply(
    lambda x: x[['전처리_결과_1', '전처리_결과_2', '전처리_결과_3',
                 '전처리_결과_4', '전처리_결과_5', '전처리_결과_6']].apply(lambda row: [item for item in row if pd.notna(item)], axis=1).sum()
).reset_index(name='CombinedData')


print(grouped_df['CombinedData'])
print(grouped_df['region'])
newlist = []
for value in grouped_df['CombinedData']:
    for data in value:
        newlist.append(data)

# print(set(newlist))
# {'빠리치킨（한마리）', '마라핫치킨한마리', '뱀파이어 치킨 단품', '황올 엉치치킨 8조각', '골드더스트치즈그라탕', '포테이토치즈그라탕', '오리지날양념치킨（순살）', '황금올리브치킨속안심반반', '자메이카 소떡', '메이플버터갈릭6개', '눈맞은닭（윙&봉）', '코카-콜라 235ml', '쇼콜라볼', '오리지날 양념치킨', 'TOP3세트메뉴 Set3', ' 소떡', '황금올리브치킨순살', '착착갈릭', '단짠갈릭', '파더s치킨두마리', '빠리치킨（윙）', '새우스틱개', '핫 황금올리브 콤보반반（크리스피＋찐킹소스）', '황금올리브치킨 순살', '자메이카통다리구이＋황금알치즈볼', '순살바삭칸', '황올 반＋양념 반（콤보）', '양념치킨', ' 모듬볼', '자메이카 통다리구이 반마리', '다리가 두개 더 세트SET 1', '자메이카＋코카-콜라1.25L', '황올반＋블랙페퍼반＋황금알2개[소스플레이트 증정]', '멘보샤', '순살크래커', '황금올리브치킨 콤보 반반', '애플치즈볼', '황금올리브치킨콤보', '황금올리브치킨블랙페퍼 ', '왕갈비당고세트대', '황금올리브（반반）', '제로콜라', '황올 엉치치킨 6조각＋케이준', '닭껍데기추가', '핫황금올리브치킨레드착착', '황금올리브치킨＋크림치즈볼', '올치팝컵', '체고치 순살', '메이플2개＋황올반＋볼4개랜덤', '페일 에일', '순살치즐링', '황올 반＋양념 반콤보', '롱치즈스틱', '황금올리브치킨블랙페퍼（콤보）', '스파클링', '메이플2개＋황올다리2개', '극한왕갈비치킨＋크림치즈볼', '써프라이드＋코카-콜라 1.25L', '메이플버터갈릭（4개）', '오리지널 콤보반반（황금올리브＋크리스피）', '오징어튀김개', '우유튀김', '닭다리살 스테이크', '고구마치즈볼', '황금올리브반반', '볼케이노핫소스', ' 모둠볼 케이준감자', '체고바 순살', '허니포테이토', '메이플6개＋크리스피반', '모둠볼', '크림치즈볼', '햄치즈롱스틱', '멘보샤콜라', '허니갈릭스（한마리）', '닭껍데기멘보샤', '황금올리브반반＋황금알치즈볼', '황금올리브치킨 콤보 블랙페퍼', '황금올리브치킨 반마리', '황금올리브반반＋콜라.25L', '극한매운왕갈비치킨', '페일 에일500cc', '핫킹세트1', '다리가 두개 더 세트SET 5', '핫킹세트', '황올 크런치 너겟（크래커）', '생맥주', '생맥주 ', '핫크리스피 반마리', '오리지널 반반황올＋블랙페퍼', '바이젠', '핫황금올리브 레드착착', '핫황금올리브', '황금올리브치킨 콤보 핫크리스피', '코카-콜라 1.25L', '닭껍데기', '치즐링순살크래커', '바이젠500cc', '메이플6개＋황올반', '허니갈릭스（윙）', '감자튀김', ' 삼계탕', '소이갈릭스한마리', '허니버터갈릭스', '크런치버터치킨', '닭껍데기소떡', '황금올리브핫윙', '황올 반＋블랙페퍼 반', '핫황올 엉치치킨', '핫황올 블랙페퍼 순살', 'TOP3세트메뉴 Set1', '황금올리브 반마리', '황금올리브치킨 속안심', '마라핫치킨', '황금알치즈볼', '자메이카통다리구이＋크림치즈볼', '비비소스 추가', '추가', '블랙페퍼 반＋레드착착 반', '다리가 두개 더 세트 ', '닭다리콤보（엉치4＋닭다리2＋케이준감자）', '핫황올 찐킹소스 닭다리', '핫황금올리브치킨크리스피（콤보）', '바삭칸치킨（반반）', '모둠감자튀김', '닭껍데기황올한닭발튀김', '써프라이드＋오리지널포테이토＋콜라1.25', 'TOP3세트메뉴 Set2', '황금올리브반반＋코카-콜라 1.25L', '맥주 ', '황금올리브치킨', '황금올리브치킨 ', '치킨강정（순살）', '양념치킨 반마리', '오리지널 콤보반반（황금올리브＋블랙페퍼）', '핫 황금올리브 콤보반반（블랙페퍼＋크리스피）', '핫황올 엉치치킨 8조각', '핫황올 블랙페퍼 닭다리', "파더's치킨（로스트 갈릭）", '다리가 두개 더 세트SET 4', '황올 엉치치킨 6조각', '고구마스틱', '케이준감자더블치즈볼', '시크릿 양념소스', '써프라이드치킨', '치즈스틱', ' 양념치킨 ', '비비소스', '황금올리브치킨블랙페퍼 반마리', '케이준감자', '은지 세트', '써프라이드＋코카-콜라1.25L', '통새우', '황금올리브치킨속안심', '오리지널 반반（황올＋레드착착）', '치즐링 칩스', '오징어링', '황금올리브4치세트2（자메이카통다리）', '황올한 깐풍순살', '다리가 두개 더 세트SET 2', '양념치킨 ', '바삭갈릭＋레몬보이5', '황올 엉치치킨 4조각', '자메이카＋올치팝（컵）', '황금올리브닭다리', '자메이카 소떡만나 콤보치킨', ' 모둠볼 0개', '써프라이드치킨순살', '오리지널 콤보반반황금올리브＋레드착착', '통새우 멘보샤', '오리지널 콤보반반（황금올리브＋레드착착）', '바삭갈릭레몬보이5 증정', '크리스피 반＋레드착착 반', '쉐킷쉐킷 치즈맛', '황금올리브치킨 콤보 양념', '스모크치킨 ', '자메이카 소떡만나치킨순살', '써프라이드치킨（순살）', '극한왕갈비치킨', '볼케이노핫소스소떡콜라', '메이플4개＋모둠볼6개', '황금올리브 반반＋올치팝（컵）', '자메이카＋오리지널포테이토＋콜라1.25', '더블치즈볼', '황금올리브치킨레드착착 ', '바삭갈릭（레몬보이5 증정）', '스파클링레몬보이', '바삭갈릭', '황금올리브반반＋크림치즈볼', ' ', '메이플버터갈릭개', '치즐링', ' 모듬볼 ', '마라핫치킨（순살） L', '볼멘보샤', '왕갈비당고세트（대）', '황올 반＋양념 반', '닭다리살 스테이크통다리바비큐맛', '오리지널 콤보반반（황금올리브＋찐킹소스）', '콘샐러드', '소떡', '콜라', '핫황금올리브치킨블랙페퍼 반마리', '황금올리브치킨레드착착 반마리', '오리지날양념치킨', '황금올리브 속안심 반마리', 'SET）자메이카＋오리지널포테이토＋콜라1.25', '콜라추가메뉴', '로제치킨', '게살크림고로케', '핫황금올리브크리스피＋황금알치즈볼', '황금올리브닭다리반반', '황금올리브치킨＋오리지날포테이토', '황올＋오리지널포테이토＋콜라1.25', '단짠갈릭（레몬보이5 증정）', '스프라이트', '오감볼', '자메이카 통다리구이', '자메이카 소떡만나 순살치킨', ' 소떡왕갈비맛', '황금올리브＋콜라1.25', '황금올리브치킨순살반반', '시크릿양념치킨', '황금올리브＋코카-콜라1.25L', '소이갈릭스（한마리）', '오징어튀김', '황올 반＋매운양념 반', '황올한닭발튀김', '황금올리브＋올치팝（컵）', '핫 황금올리브 콤보반반（레드착착＋블랙페퍼）', '오리지널 반반（황올＋블랙페퍼）', '케이준감자자메이카 통다리구이', '오리지날양념치킨 반마리', '황올 반＋레드착착 반', '황금올리브닭다리（반반）', '핫킹세트3', '황올 반＋양념 반（닭다리）', '바삭칸치킨반반', '황금올리브닭다리＋크림치즈볼', '극한매운왕갈비치킨＋황금알치즈볼', '황금올리브（반반）＋크림치즈볼', '더블치즈볼5개', '핫황금올리브 블랙페퍼', '만나치킨', '황금올리브닭다리（매운）', '치즈볼', '황올 반＋양념 반순살', '오징어스틱', '크림치즈', '착착갈릭（레몬보이5 증정）', '크런치 버터치킨', '메이플버터갈릭', '황금올리브치킨순살양념', '써프라이드 치킨', '황금올리브（매운반반）', ' 닭껍데기', '크런치 순살크래커', '모듬볼 ', '메이플', '스프라이트 ', '파더s갈릭（한마리）', '양념소스', '자메이카 소떡만나치킨（순살）', '콜라크림치즈볼', '황올 왕새우 세트', '핫킹세트2', '황금올리브치킨（순살）', '핫 황금올리브 콤보반반（레드착착＋크리스피）', '핫황금올리브 찐킹소스', '닭껍데기콜라', '콜라 ', '바삭칸 치킨', ' 모둠볼', '스파클링 ', '황금올리브반반＋오리지날포테이토', '매달구', '황금올리브치킨 반반', '딥치즈포테이토', '자메이카 소떡만나치킨（콤보）', '오리지널 반반（황올＋크리스피）', '핫황금올리브치킨크리스피', '크리스피 반＋블랙페퍼 반', '메이플버터갈릭（6개）', '스모크치킨', '소이갈릭스（윙）', '오지구이 떡구이세트', '핫황올 엉치치킨 조각', '황금올리브치킨크런치 버터', '핫킹세트6', '황금올리브치킨（닭다리） 반마리', ' 감자튀김', '황금올리브치킨 콤보', '황금올리브치킨（닭다리）', '황금올리브치킨닭다리', '황금올리브닭다리（＋볼케이노핫소스_한팩）', '메이플6개＋블랙페퍼반', '케이준감자닭껍데기', '밀크크림소스', '황금알치즈볼매운맛', '황금올리브치킨닭다리반반', '황금올리브치킨반반', '황올 반＋양념 반（순살）', '황금올리브치킨핫윙', '자메이카 소떡만나치킨', '다리가 두개 더 세트', '황금올리브치킨닭다리 반마리', '매운양념치킨', '모듬볼', '새우스틱', '핫 황금올리브 콤보반반（블랙페퍼＋찐킹소스）', '소주', '황금올리브속안심', '치킨무 추가', '꼬꼬컵', '소이갈릭스', '황금올리브치킨블랙페퍼', '리얼초코볼', '치즐링＋황금알치즈볼', '황금올리브치킨핫윙（냉장）', '우유튀김콜라', '닭껍데기오징어튀김', '크런치 순살크래커 반반', '황금올리브치킨（콤보）', '황올한 깐풍치킨', '핫황금올리브 크리스피', '코카-콜라 5', '황금올리브치킨순살＋황금알치즈볼', '볼케이노 핫소스50g', '마라핫치킨（한마리）', '코울슬로', '황금알치즈볼콜라', '오리지날포테이토', '닭껍데기케이준감자', '황올한 닭발튀김', '마라핫치킨（윙）'}


# 공백 제거
cleaned_data = {item.strip() for item in newlist}
print(f"cleaned_data:{cleaned_data}")
# cleaned_data:{'', '황금올리브치킨（콤보）', '오리지널 콤보반반（황금올리브＋블랙페퍼）', '오리지널 반반（황올＋블랙페퍼） ( 콤보 )',
#               '황금올리브핫윙', '오감볼', '핫황금올리브 레드착착', '크런치 크래커', '황금올리브치킨 콤보 핫크리스피', '오리지널포테이토',
#               '크런치 버터치킨', '페일 에일', '황금올리브치킨핫윙', '꼬꼬컵', '만나치킨', '케이준감자닭껍데기', '치즐링크래커',
#               '극한매운왕갈비치킨', '오리지날포테이토', '황올반', '황금올리브치킨닭다리 반마리', '황올 반＋매운양념 반( 콤보 )',
#               '황금알치즈볼콜라', '크리스피 반＋블랙페퍼 반 ( 콤보 )', '은지 세트', '황금올리브4치세트（자메이카통다리）',
#               '자메이카 소떡만나치킨순살', '햄치즈롱스틱', '핫황올 블랙페퍼', '핫황금올리브 찐킹소스', '오징어튀김개', '순살치즐링',
#               '올치팝컵', '오징어링', '볼', '핫킹세트1', '치킨무 추가', '볼케이노핫소스소떡콜라', '소떡왕갈비맛', '황올한 깐풍순살',
#               '크림치즈', '황올다리', '오리지날 양념치킨', '착착갈릭', '콜라크림치즈볼', '골드더스트치즈그라탕', '바삭칸 치킨',
#               '황올 크런치 너겟（크래커）', '황금올리브치킨닭다리', '자메이카 소떡만나치킨（콤보）', '딥치즈포테이토', '닭껍데기오징어튀김',
#               '황올 반＋양념 반 ( 콤보 )', '황금올리브닭다리（매운）', '로제치킨', '황올 엉치치킨 6조각',
#               '핫 황금올리브 콤보반반（레드착착＋크리스피）', '황금올리브 반반', '스파클링레몬보이', '황금올리브치킨 순살',
#               '바삭갈릭', '콜라추가메뉴', '올치팝（컵）', '삼계탕', '다리가 두개 더 세트', '치즈볼', '새우스틱개', '콜라',
#               '생맥주', '오리지널 반반（황올＋블랙페퍼）', '롱치즈스틱', '황금올리브치킨 반반', '크래커', '황금올리브치킨 콤보',
#               '콘샐러드', '핫황올 블랙페퍼 닭다리', '핫황금올리브', '황금올리브반반＋황금알치즈볼', '황금알치즈볼매운맛', '써프라이드',
#               '소떡', '황올 반＋양념 반 ( 콤보 )（콤보）', '밀크크림소스', '빠리치킨', '황금올리브 ( 콤보 )', '크리스피 반＋레드착착 반',
#               '핫황올 엉치치킨 조각', '황금알치즈볼', '오징어스틱', 'SET）자메이카＋오리지널포테이토( 콤보 )', '핫 황금올리브 콤보반반',
#               '볼케이노핫소스', '황올 반＋블랙페퍼 반 ( 콤보 )', '닭다리살 스테이크통다리바비큐맛', '비비소스', '황금올리브치킨블랙페퍼',
#               '체고바', '닭껍데기콜라', '닭껍데기', '소이갈릭스（윙）', '치즐링', '눈맞은닭（윙&봉）', '황금올리브치킨 콤보 양념',
#               '통새우 멘보샤', '핫황금올리브 블랙페퍼', '자메이카 통다리구이', '극한왕갈비치킨', '황금올리브치킨 콤보 블랙페퍼',
#               '고구마스틱', '자메이카 소떡', '마라핫치킨', '메이플2개', '코카-콜라 235ml', '닭껍데기추가', '뱀파이어 치킨 단품',
#               '코울슬로', '닭껍데기소떡', '오리지널 반반', '황올 반＋레드착착 반', '황금올리브치킨', '스프라이트', '치즐링 칩스',
#               '다리가 두개 더 세트SET 5  ( 콤보 )', '다리가 두개 더 세트SET 1', '황금올리브치킨반반', '황금올리브치킨레드착착',
#               '모둠볼', '스파클링', '핫황올 엉치치킨', '써프라이드치킨', '핫황금올리브크리스피', '제로콜라', '소이갈릭스',
#               '황금올리브닭다리 ( 콤보 )', '고구마치즈볼', '황금올리브치킨양념', '순살크래커', '바삭칸치킨 ( 콤보 )',
#               'TOP3세트메뉴 Set2', '핫황금올리브치킨크리스피', '소주', '황금올리브치킨순살', '단짠갈릭', '쇼콜라볼', '메이플버터갈릭6개',
#               '황금올리브치킨 콤보 반반', '치킨강정', '핫크리스피', '바삭칸치킨반반', '황올 엉치치킨 8조각', '볼멘보샤', '핫킹세트',
#               '황금올리브속안심', '메이플2개＋황올다리2개', '황금올리브치킨크런치 버터', '오리지널 콤보반반（황금올리브＋찐킹소스）',
#               '케이준', '모둠감자튀김', '우유튀김', '더블치즈볼', '메이플6개＋블랙페퍼반', '블랙페퍼반', '허니버터갈릭스',
#               '황금올리브 속안심', '게살크림고로케', '핫황금올리브치킨레드착착', '오지구이 떡구이세트', '멘보샤', '황올한 깐풍',
#               '바이젠', '오징어튀김', '써프라이드 치킨', '맥주', '멘보샤콜라', '크리스피반', '매달구', '다리가 두개 더 세트SET 4',
#               '핫킹세트3', '자메이카', '왕갈비당고세트（대）', '추가', '황금올리브치킨＋크림치즈볼', '황올 반＋매운양념 반 ( 콤보 )',
#               '자메이카 소떡만나치킨', '핫황올 블랙페퍼 순살', '황올한 닭발튀김', '황금올리브치킨닭다리반반', '새우스틱',
#               '황올 반＋블랙페퍼 반', '바삭칸', '황올 엉치치킨', '통새우', '황올 반＋양념 반 ( 콤보)', '황금올리브닭다리',
#               '쉐킷쉐킷 치즈맛', '크림치즈볼', '황금올리브치킨 속안심', '자메이카 소떡만나 콤보치킨', '케이준감자', '메이플',
#               '황금올리브반반', '황금올리브＋올치팝（컵）( 콤보 )', '감자튀김', 'TOP3세트메뉴 Set1 ( 콤보 )', '메이플버터갈릭개',
#               '오리지널 반반（황올＋크리스피）', '황금올리브치킨속안심반반', '스모크치킨', '자메이카통다리구이', '블랙페퍼 반＋레드착착 반',
#               '허니갈릭스（윙）', '다리가 두개 더 세트SET 5', 'TOP3세트메뉴 Set3', '모듬볼', '닭껍데기멘보샤', '닭다리살 스테이크',
#               '닭껍데기황올한닭발튀김', '황금올리브닭다리반반', '비비소스 추가', '허니포테이토', '케이준감자더블치즈볼', '황금알',
#               '양념치킨', '치즈스틱', '황금올리브치킨속안심', '자메이카 소떡만나 치킨', '크런치 크래커 반반', '황금올리브치킨콤보',
#               '황올한닭발튀김', "파더's치킨（로스트 갈릭）", '황금올리브（매운반반）', '닭다리콤보', '빠리치킨（윙）',
#               '황금올리브치킨블랙페퍼（콤보）', '오리지널 반반（콤보）', '파더s치킨두마리', '파더s갈릭',
#               '핫 황금올리브 콤보반반（블랙페퍼＋찐킹소스）', '왕갈비당고세트대', '매운양념치킨', '소이갈릭스한마리',
#               '핫황금올리브치킨블랙페퍼', '메이플버터갈릭', '핫황올 찐킹소스 닭다리', '모둠볼 케이준감자', '황올 왕새우 세트',
#               '마라핫치킨（윙）', '핫황금올리브 크리스피', '닭껍데기케이준감자', '리얼초코볼', '크리스피 반＋블랙페퍼 반',
#               '황올 반＋블랙페퍼 반( 콤보 )', '황올한 깐풍치킨', '핫황금올리브치킨크리스피（콤보）', '체고치', '오리지널 콤보반반',
#               '우유튀김콜라', '허니갈릭스', '다리가 두개 더 세트SET 2', '황금올리브', '황올', '메이플6개', '볼4개', '오리지날양념치킨',
#               '시크릿양념치킨', '케이준감자자메이카 통다리구이', '마라핫치킨한마리', '오리지널 반반황올＋블랙페퍼 ( 콤보 )',
#               '크런치버터치킨', '황올 반＋매운양념 반', '애플치즈볼', '시크릿 양념소스', '포테이토치즈그라탕', '양념소스'}

# 맛별로 리스트 할당
# 임의로 할당
flavors = {
    'spicy': ['자메이카통다리구이', '황금올리브핫윙', '핫황금올리브 레드착착', '황금올리브치킨핫윙', '만나치킨', '극한매운왕갈비치킨',
              '황금올리브4치세트（자메이카통다리）', '자메이카 소떡만나치킨순살', '핫황올 블랙페퍼', '핫황금올리브 찐킹소스','핫킹세트1',
              '황금올리브닭다리（매운）', '핫황올 블랙페퍼 닭다리', '핫황금올리브', '핫황올 엉치치킨 조각', '핫황금올리브 블랙페퍼','자메이카 통다리구이',
              '극한왕갈비치킨', '마라핫치킨','뱀파이어 치킨 단품','황금올리브치킨레드착착','핫황올 엉치치킨', '핫황금올리브치킨크리스피', '핫크리스피',  '메이플6개＋블랙페퍼반', '블랙페퍼반',
              '핫황금올리브치킨레드착착','핫킹세트3', '자메이카', '자메이카 소떡만나치킨','핫황올 블랙페퍼 순살', '자메이카통다리구이',  '양념치킨',  '자메이카 소떡만나 치킨', '매운양념치킨',
              '핫황금올리브치킨블랙페퍼',  '핫황올 찐킹소스 닭다리', '마라핫치킨（윙）', '핫황금올리브 크리스피','오리지날양념치킨', '시크릿양념치킨', '마라핫치킨한마리',
              ],
    'sweet': [],
    'normal' :['황금올리브치킨닭다리 반마리', '황올한 깐풍순살','오리지날 양념치킨', '착착갈릭', '황올다리', '바삭칸 치킨','황금올리브치킨닭다리', '황올 엉치치킨 6조각',
               '황금올리브치킨 순살','은지 세트', '로제치킨', '바삭갈릭', '황금올리브치킨',  '황금올리브치킨순살','단짠갈릭',  '황금올리브속안심',
               '메이플2개＋황올다리2개', '황금올리브치킨크런치 버터','오리지널 콤보반반（황금올리브＋찐킹소스）',
              '케이준', '허니버터갈릭스','황금올리브 속안심', '써프라이드 치킨', '크리스피반','황금올리브치킨＋크림치즈볼', '바삭칸', '황올 엉치치킨', '황금올리브닭다리',
               '황금올리브치킨 속안심','황금올리브＋올치팝（컵）( 콤보 )', '스모크치킨', '허니갈릭스（윙）', '황금올리브치킨속안심',"파더's치킨（로스트 갈릭）", '빠리치킨（윙）',
               '파더s치킨두마리', '파더s갈릭', '소이갈릭스한마리','메이플버터갈릭', '허니갈릭스','황금올리브', '황올', '크런치버터치킨',
               ],
    'unique': ['황금올리브치킨（콤보）', '오리지널 콤보반반（황금올리브＋블랙페퍼）',  '오리지널 반반（황올＋블랙페퍼） ( 콤보 )','황금올리브치킨 콤보 핫크리스피',
               '황올 반＋매운양념 반( 콤보 )', '크리스피 반＋블랙페퍼 반 ( 콤보 )', '자메이카 소떡만나치킨（콤보）',  '황올 반＋양념 반 ( 콤보 )',
               '핫 황금올리브 콤보반반（레드착착＋크리스피）', '황금올리브 반반','오리지널 반반（황올＋블랙페퍼）', '황금올리브치킨 반반', '황금올리브치킨 콤보',
               '황올 반＋양념 반 ( 콤보 )（콤보）', '빠리치킨', '황금올리브 ( 콤보 )', '크리스피 반＋레드착착 반','SET）자메이카＋오리지널포테이토( 콤보 )', '핫 황금올리브 콤보반반',
               '황올 반＋블랙페퍼 반 ( 콤보 )', '황금올리브치킨 콤보 블랙페퍼', '오리지널 반반', '황올 반＋레드착착 반', '다리가 두개 더 세트SET 5  ( 콤보 )', '다리가 두개 더 세트SET 1', '황금올리브치킨반반',
               '써프라이드치킨', '핫황금올리브크리스피', '황금올리브닭다리 ( 콤보 )', '바삭칸치킨 ( 콤보 )','바삭칸치킨반반','핫킹세트','황올 반＋매운양념 반 ( 콤보 )',
              'TOP3세트메뉴 Set2', '다리가 두개 더 세트SET 4','황금올리브치킨닭다리반반',   '황올 반＋블랙페퍼 반','황올 반＋양념 반 ( 콤보)','자메이카 소떡만나 콤보치킨',
               '황금올리브반반', 'TOP3세트메뉴 Set1 ( 콤보 )','오리지널 반반（황올＋크리스피）', '황금올리브치킨속안심반반',  '블랙페퍼 반＋레드착착 반','다리가 두개 더 세트SET 5', 'TOP3세트메뉴 Set3',
               '크런치 크래커 반반', '황금올리브치킨콤보', '황금올리브（매운반반）', '닭다리콤보','황금올리브치킨블랙페퍼（콤보）', '오리지널 반반（콤보）','핫 황금올리브 콤보반반（블랙페퍼＋찐킹소스）',
               '크리스피 반＋블랙페퍼 반','황올 반＋블랙페퍼 반( 콤보 )','황금올리브닭다리반반', '핫황금올리브치킨크리스피（콤보）','오리지널 콤보반반','다리가 두개 더 세트SET 2', '오리지널 반반황올＋블랙페퍼 ( 콤보 )',
               '황올 반＋매운양념 반',
               ],
    'etc' : ['오감볼', '크런치 크래커', '오리지널포테이토', '크런치 버터치킨','페일 에일', '꼬꼬컵',
             '케이준감자닭껍데기', '치즐링크래커', '오리지날포테이토', '황올반',  '황금알치즈볼콜라',
             '햄치즈롱스틱', '오징어튀김개', '순살치즐링','올치팝컵', '오징어링', '볼', '치킨무 추가', '볼케이노핫소스소떡콜라', '소떡왕갈비맛',  '크림치즈', '콜라크림치즈볼',
             '골드더스트치즈그라탕', '황올 크런치 너겟（크래커）',  '딥치즈포테이토', '닭껍데기오징어튀김','스파클링레몬보이', '콜라추가메뉴', '올치팝（컵）', '삼계탕', '다리가 두개 더 세트', '치즈볼', '새우스틱개', '콜라',
              '생맥주',  '롱치즈스틱',  '크래커', '콘샐러드',  '황금올리브반반＋황금알치즈볼', '황금알치즈볼매운맛', '써프라이드',
              '소떡',  '밀크크림소스','황금알치즈볼', '오징어스틱','볼케이노핫소스','닭다리살 스테이크통다리바비큐맛', '비비소스', '황금올리브치킨블랙페퍼',
              '체고바', '닭껍데기콜라', '닭껍데기', '소이갈릭스（윙）', '치즐링', '눈맞은닭（윙&봉）', '황금올리브치킨 콤보 양념',
              '통새우 멘보샤',  '고구마스틱', '자메이카 소떡',  '메이플2개', '코카-콜라 235ml', '닭껍데기추가',  '코울슬로', '닭껍데기소떡','스프라이트', '치즐링 칩스', '모둠볼', '스파클링',
             '제로콜라', '소이갈릭스', '고구마치즈볼', '황금올리브치킨양념', '순살크래커','소주', '쇼콜라볼', '메이플버터갈릭6개','황금올리브치킨 콤보 반반', '치킨강정','황올 엉치치킨 8조각', '볼멘보샤',
             '모둠감자튀김', '우유튀김', '더블치즈볼', '게살크림고로케',  '오지구이 떡구이세트', '멘보샤', '황올한 깐풍', '바이젠', '오징어튀김','맥주', '멘보샤콜라','매달구','왕갈비당고세트（대）', '추가',
             '황올한 닭발튀김','새우스틱', '통새우', '쉐킷쉐킷 치즈맛', '크림치즈볼',  '케이준감자', '메이플','감자튀김', '메이플버터갈릭개', '모듬볼', '닭껍데기멘보샤', '닭다리살 스테이크',
              '닭껍데기황올한닭발튀김',  '비비소스 추가', '허니포테이토', '케이준감자더블치즈볼', '황금알', '치즈스틱', '황올한닭발튀김','왕갈비당고세트대','모둠볼 케이준감자', '황올 왕새우 세트',
             '닭껍데기케이준감자', '리얼초코볼','황올한 깐풍치킨','체고치','우유튀김콜라', '메이플6개', '볼4개', '케이준감자자메이카 통다리구이', '애플치즈볼','시크릿 양념소스', '포테이토치즈그라탕', '양념소스',
             '포테이토치즈그라탕','양념소스'
             ]
}

# 각 맛별로 할당된 아이템을 리스트에 저장
flavor_lists = {key: [] for key in flavors}  # 각 맛별로 빈 리스트 생성

for item in cleaned_data:
    for flavor, items in flavors.items():
        if item in items:
            flavor_lists[flavor].append(item)

print(f"flavor_lists:{flavor_lists}")

#######################################################################################################################
# 각 맛별로 매칭되는 아이템을 검색하여 맛 리스트를 생성
# 각 행의 맛 카테고리 카운트
for row in grouped_df['CombinedData']:
    count = {key: 0 for key in flavor_lists}
    for item in row:
        for flavor, items in flavor_lists.items():
            if item in items:
                count[flavor] += 1
                break

print(count)

labels = list(count.keys())
sizes = list(count.values())
print(labels)

plt.pie(sizes, labels=flavor_lists.keys(), autopct='%1.1f%%')
plt.show()
plt.close()

def plot_grouped_pie_charts(dataframe, region_column, flavor_column):
    regions = dataframe[region_column].unique()
    results = []
    region_titles = []

    for region in regions:
        region_data = dataframe[dataframe[region_column] == region]
        flavor_counts = region_data[flavor_column].explode().value_counts()

        if not flavor_counts.empty:
            results.append(flavor_counts)
            region_titles.append(region)

    # 3개씩 그룹화하여 파이 차트 그리기
    for i in range(0, len(results), 3):
        fig, axs = plt.subplots(1, 3, figsize=(14, 14))  # 한 행에 3개의 차트
        for j, ax in enumerate(axs):
            if i + j < len(results):
                sizes = results[i + j]
                labels = sizes.index
                ax.pie(sizes, labels=labels, autopct='%1.1f%%', startangle=90)
                ax.set_title(region_titles[i + j])
            else:
                ax.axis('off')  # 더 이상 표시할 데이터가 없으면 축 비활성화

        plt.tight_layout()
        plt.savefig(f'마포구 BBQ pie_charts_row_{i // 3 + 1}.png', dpi=300, bbox_inches='tight')
        plt.close(fig)

plot_grouped_pie_charts(df, 'region', '순살여부')